# Challenges

1. find out their av. rating on weekly basis, keeping in mind two days leave
2. total working days for each agent
3. total query taken, 
4. total feedback receved
5. agent name who have av rating between 3.5 to 4
6. agent name who have rating less than 3.5
7. agent name who have rating > 4.5
8. how many feedback agent have recieved > 4.5 average
9. average weekly response time for each agent 
10. average weekely resolution time for each agents 
11. list of all agents name 
12. percentage of chat on which they have received a feedback 
13. Total contributation hour for each and every agents weekly basis 
14. total percentage of active hour for a month 

sunny.savita@ineuron.ai

deadline today : 12am today

In [111]:
import pandas as pd

In [112]:
df1 = pd.read_csv('Agent Login Report.csv',skiprows=[0,1], names=['Agent_Name', 'Date', 'Login_Time', 'Logout_Time', 'Duration'])

In [113]:
df2 = pd.read_csv('Agent Performance Report.csv', skiprows=[0,1], names=['Date', 'Agent_Name', 'Total_Chats', 'Average_Response_Time', 'Average_Resolution_Time', 'Average_Rating', 'Total_Feedback'])

In [114]:
df1.drop('SL No', inplace = True)

In [115]:
df1.head()

           Agent_Name       Date   Login_Time  Logout_Time  Duration
1  Shivananda Sonwane  30-Jul-22  03:35:29 PM  05:39:39 PM  02:04:10
2      Khushboo Priya  30-Jul-22  03:06:59 PM  03:07:16 PM  00:00:17
3       Nandani Gupta  30-Jul-22  03:04:24 PM  05:31:07 PM  02:26:42
4     Hrisikesh Neogi  30-Jul-22  02:34:29 PM  03:19:35 PM  00:45:06
5             Mukesh   30-Jul-22  02:03:15 PM  03:11:52 PM  01:08:36

In [126]:
df2.head()

,Date,Agent_Name,Total_Chats,Average_Response_Time,Average_Resolution_Time,Average_Rating,Total_Feedback
1,2022-07-30,Prerna Singh,11,00:00:38,00:04:20,4.11,9
2,2022-07-30,Nandani Gupta,11,00:01:15,00:28:25,3.14,7
3,2022-07-30,Ameya Jain,14,00:00:30,00:11:36,4.55,11
4,2022-07-30,Mahesh Sarade,14,00:01:04,00:15:46,4.71,7
5,2022-07-30,Swati,14,00:01:11,00:16:33,3.67,6

In [133]:
df2['Date_'] = pd.to_datetime(df2['Date'])

In [134]:
df2['Week'] = df2['Date_'].dt.week

<ipython-input-134-8e5fc9e06710>:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  df2['Week'] = df2['Date_'].dt.week

In [136]:
df2['Month'] = df2['Date_'].dt.month

In [137]:
df2['Year'] = df2['Date_'].dt.year

In [138]:
df2['Day'] = df2['Date_'].dt.day

In [140]:
df2.drop('Date', axis=1, inplace=True)

In [141]:
df2.head()

,Agent_Name,Total_Chats,Average_Response_Time,Average_Resolution_Time,Average_Rating,Total_Feedback,Date_,Week,Month,Year,Day
1,Prerna Singh,11,00:00:38,00:04:20,4.11,9,2022-07-30,30,7,2022,30
2,Nandani Gupta,11,00:01:15,00:28:25,3.14,7,2022-07-30,30,7,2022,30
3,Ameya Jain,14,00:00:30,00:11:36,4.55,11,2022-07-30,30,7,2022,30
4,Mahesh Sarade,14,00:01:04,00:15:46,4.71,7,2022-07-30,30,7,2022,30
5,Swati,14,00:01:11,00:16:33,3.67,6,2022-07-30,30,7,2022,30

In [ ]:
# Ans 1- find out their av. rating on weekly basis, keeping in mind two days leave

In [171]:
df2.groupby(['Agent_Name','Week'])['Average_Rating'].mean()

Agent_Name  Week
Abhishek    26      0.000000
            27      0.000000
            28      0.000000
            29      0.000000
            30      0.000000
                      ...
Zeeshan     26      0.000000
            27      1.307143
            28      2.948571
            29      3.180000
            30      2.760000
Name: Average_Rating, Length: 350, dtype: float64

In [168]:
# Ans 2 - total working days for each agent

In [172]:
df2.groupby('Agent_Name')['Day'].count()

Agent_Name
Abhishek         30
Aditya           30
Aditya Shinde    30
Aditya_iot       30
Amersh           30
                 ..
Uday Mishra      30
Vasanth P        30
Vivek            30
Wasim            30
Zeeshan          30
Name: Day, Length: 70, dtype: int64

In [173]:
df2['Day'].unique()

array([30, 29, 28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15, 14,
       13, 12, 11, 10,  9,  8,  7,  6,  5,  4,  3,  2,  1], dtype=int64)

In [174]:
# Ans 3 - total query taken

In [175]:
df2.groupby('Agent_Name')['Total_Chats'].sum()

Agent_Name
Abhishek           0
Aditya             0
Aditya Shinde    277
Aditya_iot       231
Amersh             0
                ...
Uday Mishra        0
Vasanth P          0
Vivek             44
Wasim            433
Zeeshan          542
Name: Total_Chats, Length: 70, dtype: int64

In [176]:
# Ans 4 - total feedback receved

In [177]:
df2.groupby('Agent_Name')['Total_Feedback'].sum()

Agent_Name
Abhishek           0
Aditya             0
Aditya Shinde    153
Aditya_iot       131
Amersh             0
                ...
Uday Mishra        0
Vasanth P          0
Vivek             20
Wasim            284
Zeeshan          335
Name: Total_Feedback, Length: 70, dtype: int64

In [ ]:
# Ans 5 - agent name who have av rating between 3.5 to 4

In [190]:
df3 = pd.DataFrame(df2.groupby('Agent_Name')['Average_Rating'].mean(), columns=['Agent', 'Average_Rating']).reset_index(drop=True)

In [192]:
df3['Agent'] = df2.groupby('Agent_Name')['Average_Rating'].mean().index

In [193]:
df3

            Agent  Average_Rating
0       Abhishek         0.000000
1         Aditya         0.000000
2   Aditya Shinde        1.800333
3     Aditya_iot         2.345333
4         Amersh         0.000000
..            ...             ...
65    Uday Mishra        0.000000
66      Vasanth P        0.000000
67         Vivek         0.500667
68         Wasim         2.400000
69       Zeeshan         2.287000

[70 rows x 2 columns]

In [200]:
df3[(df3['Average_Rating'] > 3.5) & (df3['Average_Rating'] < 4)]

                  Agent  Average_Rating
15  Boktiar Ahmed Bappy        3.568000
24       Ishawant Kumar        3.543333
28       Khushboo Priya        3.703667
34         Manjunatha A        3.594667

In [ ]:
# Ans 6 - agent name who have rating less than 3.5

In [202]:
df3[(df3['Average_Rating'] < 3.5)]

            Agent  Average_Rating
0       Abhishek         0.000000
1         Aditya         0.000000
2   Aditya Shinde        1.800333
3     Aditya_iot         2.345333
4         Amersh         0.000000
..            ...             ...
65    Uday Mishra        0.000000
66      Vasanth P        0.000000
67         Vivek         0.500667
68         Wasim         2.400000
69       Zeeshan         2.287000

[65 rows x 2 columns]

In [ ]:
# Ans 7 - agent name who have rating > 4.5

In [204]:
df3[(df3['Average_Rating'] > 4)]

                 Agent  Average_Rating
57  Shivananda Sonwane        4.232667

In [ ]:
# Ans 8 - how many feedback agent have recieved with average rating > 4.5

In [253]:
df5 = pd.DataFrame(df2.groupby('Agent_Name')['Total_Feedback', 'Average_Rating'].mean(), columns=['Agent', 'Total_Feedback', 'Average_Rating']).reset_index(drop=True)

<ipython-input-253-95ccc2c90213>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df5 = pd.DataFrame(df2.groupby('Agent_Name')['Total_Feedback', 'Average_Rating'].mean(), columns=['Agent', 'Total_Feedback', 'Average_Rating']).reset_index(drop=True)

In [255]:
df5['Agent'] = df2.groupby('Agent_Name')['Total_Feedback', 'Average_Rating'].mean().index

<ipython-input-255-3aafe65b1245>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df5['Agent'] = df2.groupby('Agent_Name')['Total_Feedback', 'Average_Rating'].mean().index

In [256]:
df5

            Agent  Total_Feedback  Average_Rating
0       Abhishek         0.000000        0.000000
1         Aditya         0.000000        0.000000
2   Aditya Shinde        5.100000        1.800333
3     Aditya_iot         4.366667        2.345333
4         Amersh         0.000000        0.000000
..            ...             ...             ...
65    Uday Mishra        0.000000        0.000000
66      Vasanth P        0.000000        0.000000
67         Vivek         0.666667        0.500667
68         Wasim         9.466667        2.400000
69       Zeeshan        11.166667        2.287000

[70 rows x 3 columns]

In [257]:
df5[df5['Average_Rating'] > 4.5]

Empty DataFrame
Columns: [Agent, Total_Feedback, Average_Rating]
Index: []

In [258]:
max(df5['Average_Rating'])

4.232666666666667

In [205]:
# Ans 9 - average weekly response time for each agent

In [209]:
df2['Average_Response_Time_'] = pd.to_timedelta(df2['Average_Response_Time'])

In [218]:
df2.groupby(['Agent_Name'])['Average_Response_Time_'].sum()

Agent_Name
Abhishek        0 days 00:00:00
Aditya          0 days 00:00:00
Aditya Shinde   0 days 00:14:52
Aditya_iot      0 days 00:16:59
Amersh          0 days 00:00:00
                      ...
Uday Mishra     0 days 00:00:00
Vasanth P       0 days 00:00:00
Vivek           0 days 00:06:51
Wasim           0 days 00:14:51
Zeeshan         0 days 00:30:52
Name: Average_Response_Time_, Length: 70, dtype: timedelta64[ns]

In [ ]:
# Ans 10 - percentage of chat on which they have received a feedback

In [227]:
df2.columns

Index(['Agent_Name', 'Total_Chats', 'Average_Response_Time',
       'Average_Resolution_Time', 'Average_Rating', 'Total_Feedback', 'Date_',
       'Week', 'Month', 'Year', 'Day', 'Average_Response_Time_'],
      dtype='object')

In [237]:
df4 = pd.DataFrame(df2.groupby('Agent_Name')['Total_Chats','Total_Feedback'].mean().reset_index(drop=True), columns=['Agent_', 'Total_Chats', 'Total_Feedback'])

<ipython-input-237-49b6eb9b8cfc>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df4 = pd.DataFrame(df2.groupby('Agent_Name')['Total_Chats','Total_Feedback'].mean().reset_index(drop=True), columns=['Agent_', 'Total_Chats', 'Total_Feedback'])

In [238]:
df4['Agent_'] = df2.groupby('Agent_Name')['Total_Chats','Total_Feedback'].mean().index

<ipython-input-238-c765fc9f0a33>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df4['Agent_'] = df2.groupby('Agent_Name')['Total_Chats','Total_Feedback'].mean().index

In [239]:
df4

           Agent_  Total_Chats  Total_Feedback
0       Abhishek      0.000000        0.000000
1         Aditya      0.000000        0.000000
2   Aditya Shinde     9.233333        5.100000
3     Aditya_iot      7.700000        4.366667
4         Amersh      0.000000        0.000000
..            ...          ...             ...
65    Uday Mishra     0.000000        0.000000
66      Vasanth P     0.000000        0.000000
67         Vivek      1.466667        0.666667
68         Wasim     14.433333        9.466667
69       Zeeshan     18.066667       11.166667

[70 rows x 3 columns]

In [242]:
df4['Percentage_feed'] = (df4['Total_Feedback']*100)/df4['Total_Chats']

In [249]:
df4

           Agent_  Total_Chats  Total_Feedback  Percentage_feed
0       Abhishek      0.000000        0.000000              NaN
1         Aditya      0.000000        0.000000              NaN
2   Aditya Shinde     9.233333        5.100000        55.234657
3     Aditya_iot      7.700000        4.366667        56.709957
4         Amersh      0.000000        0.000000              NaN
..            ...          ...             ...              ...
65    Uday Mishra     0.000000        0.000000              NaN
66      Vasanth P     0.000000        0.000000              NaN
67         Vivek      1.466667        0.666667        45.454545
68         Wasim     14.433333        9.466667        65.588915
69       Zeeshan     18.066667       11.166667        61.808118

[70 rows x 4 columns]

In [219]:
# Ans 11 - list of all agents name

In [225]:
df2.Agent_Name.unique()

array(['Prerna Singh', 'Nandani Gupta', 'Ameya Jain', 'Mahesh Sarade',
       'Swati ', 'Mukesh ', 'Saikumarreddy N', 'Sanjeev Kumar',
       'Shubham Sharma', 'Nishtha Jain', 'Manjunatha A', 'Khushboo Priya',
       'Suraj S Bilgi', 'Harikrishnan Shaji', 'Hrisikesh Neogi',
       'Shivan K', 'Sowmiya Sivakumar', 'Madhulika G', 'Mithun S',
       'Hitesh Choudhary', 'Sanjeevan ', 'Anirudh ', 'Shiva Srivastava',
       'Dibyanshu ', 'Ashish ', 'Uday Mishra', 'Aditya Shinde',
       'Jayant Kumar', 'Aditya_iot ', 'Prabir Kumar Satapathy',
       'Saurabh Shukla', 'Wasim ', 'Samprit ', 'Maitry ', 'Abhishek ',
       'Rishav Dash', 'Aravind ', 'Tarun ', 'Muskan Garg', 'Ankit Sharma',
       'Bharath ', 'Ashad Nasim', 'Vasanth P', 'Aditya ', 'Amersh ',
       'Sandipan Saha', 'Ineuron Intelligence ', 'Mahak ', 'Mukesh Rao ',
       'Zeeshan ', 'Anurag Tiwari', 'Ankitjha ', 'Saif Khan',
       'Jaydeep Dixit', 'Sudhanshu Kumar', 'Maneesh ', 'Hyder Abbas',
       'Rohan ', 'Vivek ', 'Nitin M', 'Shivan_S ', 'Spuri ',
       'Ayushi Mishra', 'Chaitra K Hiremath', 'Prateek _iot ',
       'Boktiar Ahmed Bappy', 'Shivananda Sonwane', 'Ishawant Kumar',
       'Deepranjan Gupta', 'Jawala Prakash'], dtype=object)